"""
任务：给定一个集合，使用集合的内置函数来删除集合内的非整型数据，然后将集合转换成列表并对其进行排序。
打印处理之后的列表。
"""

agg = {1,"3",4,5,"4","a",(1,2,3,4),"b","c",6,17,"d",("a","b","c"),0,"e","f",True,10,"False",11,"h","A","B","C",30,"D",-35,-60,(-1,-2,-5)}

# 请在下面的Begin-End之间按照注释中给出的提示编写正确的代码
##########Begin##########
# 第一步：使用深拷贝将元组复制一遍，否则使用for循环遍历时会报错
import copy
agg2=copy.deepcopy(agg)
# 第二步：使用集合的内置函数来删除集合内的整型数据,然后将集合转换成列表并对其进行排序,打印处理之后的列表
list1 = []
for s in agg2.copy():
    if type(s) == int:
        list1.append(s)
list1.sort()
print(list1)
##########End##########
