"""
任务：给定一个数组，使用 for 循环复制这个数组，然后去除列表内的重复元素，最后对列表进行排序。打印去重且排序后的复制列表。
"""

list1 = [88, 5, 8, 6, 1, 23, 1, 15, 1, 61, 31, 6, 51, 1, 984, 9849, 1, -100, 513, 891, 3, 1, 48, 465, 132, 165, 4, 6,
         132, 498, 46, 132, 165, 468, 498, 484, 11, 6, 84, 65, 132, 1, 64, 684, 6981, 324, 984, 61, 32, 468, 4651, 6, 4,
         9814, 654, 984, 68, 7]

# 请在下面的Begin-End之间按照注释中给出的提示编写正确的代码
##########Begin##########
# 使用 for 循环复制这个数组，然后去除列表内的重复元素，最后对列表进行排序。打印去重且排序后的复制列表
list2 = []
for x in list1:
    list2.append(x)
for x in list1:
    num = 0
    for y in list2:
        if y == x:
            num += 1
        if num == 2:
            list2.remove(y)
            break
list2.sort()
print(list2)
##########End##########
